app/Controllers/Catalogue.php

    public function index()
    {
        $productosModel = new ProductsModel();

        $busqueda = $this->request->getGet('busqueda');

        $productosModel->where('activo', 1);

        if (!empty($busqueda)) {
            $productosModel->like('nombre', $busqueda);
        }

        $data = [
            'titulo'    => 'Prime Shoes | Productos',
            'productos' => $productosModel->paginate(9),
            'pager'     => $productosModel->pager,
            'busqueda'  => $busqueda,
        ];
---
SELECT *
FROM `productos`