app/Controllers/Catalogue.php

    private function buscarProductos()
    {
        $productosModel = new ProductsModel();

        $busqueda = $this->request->getGet('busqueda');

        $productosModel->where('activo', 1);

        if (!empty($busqueda)) {
            $productosModel->like('nombre', $busqueda);
        }

        $productosModel->orderBy('stock > 0 DESC, nombre', 'ASC', false);

        return [
            'productos' => $productosModel->paginate(9),
            'pager'     => $productosModel->pager,
            'busqueda'  => $busqueda,
        ];
---
SELECT *
FROM `productos`
WHERE `activo` = 1
ORDER BY stock > 0 DESC, nombre ASC
 LIMIT 9
SELECT COUNT(*) AS `numrows`
FROM `productos`
WHERE `activo` = 1