app/Controllers/CrudMarcas.php

SELECT *
FROM `marcas`
---
    public function index()
    {
        $data = ['titulo' => 'Prime Shoes | Marcas'];

        $marcasModel = new MarcasModel();
        $data['marcas'] = $marcasModel->findAll();