app/Controllers/CrudProductos.php

SELECT *
FROM `marcas`
WHERE `activo` = 1
---
    public function new()
    {
        $data = ['titulo' => 'Prime Shoes | Agregar Producto'];

        $marcasModel = new MarcasModel();
        $data['marcas'] = $marcasModel->where('activo', 1)->findAll();