app/Controllers/CrudUsers.php

SELECT *
FROM `perfiles`
SELECT *
FROM `users`
---
    public function index()
    {
        $data = ['titulo' => 'Prime Shoes | Usuarios'];

        $perfilesModel = new ProfileModel();
        $userModel = new UsersModel();

        $data['perfiles'] = $perfilesModel->findAll();
        $data['usuarios'] = $userModel->findAll();

SELECT *
FROM `perfiles`
---
    public function edit($id = null)
    {
        if ($id == null) {
            return redirect()->to('crudUsers');
        }

        $perfilesModel = new ProfileModel();
        $usersModel = new UsersModel();

        $usuario = $usersModel->find($id);

        if ($usuario === null) {
            return redirect()->to('crudUsers');
        }

        $data = [
            'titulo'   => 'Prime Shoes | Editar Usuario',
            'perfiles' => $perfilesModel->findAll(),

UPDATE `users` SET `nombre` = 'PRUEBA', `apellido` = 'AGREGAR', `dni` = '11111111', `user` = 'AGREGAR', `email` = 'AGREGAR@GMAIL.COM', `id_perfil` = '2'
WHERE `users`.`id_user` IN ('38')
---
            }
        }

        $userModel->update($id, [
            'nombre'    => trim($post['nombre']),
            'apellido'  => trim($post['apellido']),
            'dni'       => trim($post['dni']),
            'user'      => trim($post['user']),
            'email'     => trim($post['email']),
            'id_perfil' => $post['perfil'],
        ]);