app/Models/UsersModel.php

    public function validateUser($user, $pass)
    {
        $user = $this->where(['user' => $user, 'active' => 1])->first();
---
SELECT *
FROM `users`
WHERE `user` = 'AGREGAR'
AND `active` = 1
 LIMIT 1

    public function contarAdminsActivos($idExcluir = null)
    {
        $builder = $this->where('id_perfil', 1) // ajustá el 1 si tu id de perfil admin es otro
                         ->where('active', 1);

        if ($idExcluir !== null) {
            $builder->where('id_user !=', $idExcluir);
        }

        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `id_perfil` = 1
AND `active` = 1
AND `id_user` != '38'