app/Models/VentaModel.php

SELECT *
FROM `ventas`
WHERE `id_user` = '31'
ORDER BY `created_at` DESC
---
    public function getComprasPorUsuario($idUser)
    {
        return $this->where('id_user', $idUser)
                    ->orderBy('created_at', 'DESC')
                    ->findAll();

SELECT `ventas_detalle`.`qty`, `ventas_detalle`.`precio`, `productos`.`id_producto`, `productos`.`nombre`
FROM `ventas_detalle`
JOIN `productos` ON `productos`.`id_producto` = `ventas_detalle`.`id_producto`
WHERE `ventas_detalle`.`id_venta` = '25'
---
    public function getDetalleConProductos($idVenta)
    {
        return $this->db->table('ventas_detalle')
                    ->select('ventas_detalle.qty, ventas_detalle.precio, productos.id_producto, productos.nombre')
                    ->join('productos', 'productos.id_producto = ventas_detalle.id_producto')
                    ->where('ventas_detalle.id_venta', $idVenta)
                    ->get()
                    ->getResultArray();